# [[1,1,0,0,0],[0,1,0,1,1],[0,0,0,1,1],[0,0,0,0,0],[0,0,1,1,1]]
# [[1,1,0,0,0]
# ,[0,1,0,1,1]
# ,[0,0,0,1,1]
# ,[0,0,0,0,0]
# ,[0,0,1,1,1]]

def dfs(x, y, grid, m, n):
    grid[x][y] = 0
    for dx,dy in [(1,0), (0,1), (-1,0), (0,-1)]:
        if 0<=(x+dx)<=(m-1) and 0<=(y+dy)<=(n-1):
            if grid[x+dx][y+dy]:
                dfs(x+dx, y+dy, grid, m, n)
                
if __name__ == '__main__':
    grid =  [[1,1,0,0,0],[0,1,0,1,1],[0,0,0,1,1],[0,0,0,0,0],[0,0,1,1,1]]
    res = 0
    m = len(grid)
    n = len(grid[0])
    for x in range(m):
        for y in range(n):
            if grid[x][y]:
                res += 1
                dfs(x,y,grid,m,n)
    print(res)
    
'''
描述
给一个01矩阵，1代表是陆地，0代表海洋， 如果两个1相邻，那么这两个1属于同一个岛。我们只考虑上下左右为相邻。
岛屿: 相邻陆地可以组成一个岛屿（相邻:上下左右） 判断岛屿个数。
例如：
输入
[
[1,1,0,0,0],
[0,1,0,1,1],
[0,0,0,1,1],
[0,0,0,0,0],
[0,0,1,1,1]
]
对应的输出为3
(注：存储的01数据其实是字符'0','1')
示例1
输入：
[[1,1,0,0,0],[0,1,0,1,1],[0,0,0,1,1],[0,0,0,0,0],[0,0,1,1,1]]
复制
返回值：
3
复制
示例2
输入：
[[0]]
复制
返回值：
0
复制
示例3
输入：
[[1,1],[1,1]]
复制
返回值：
1
复制
备注：
01矩阵范围<=200*200
'''